#วาดเส้นตรงใส่ภาพนิ่ง,วีดิโอ  basic10
import cv2 
img = cv2.imread("image/Klage.jpeg")#อ่านภาพเข้ามา

#กำหนดขนาดภาพ
imgresize = cv2.resize(img, (700,700))#ความกว้าง,ความสูง #imgresize คือ ตัวแปรที่สร้างไว้เก็บภาพ

#วาดเส้นตรง
#line (ภาพ , จุดเริ่มต้น(x , y) , จุดสิ้นสุด(x , y) , สี (BGR), ความหนา) #สีเป็น BGR คือ blue , green , red 
# และความหนา คือความหนาของเส้นที่เราจะวาด ,จุดเริิ่มต้น และจุดสิ้นสุด คือ ลากตตั้งแต่ จุดเริ่มต้นไปจนถึงจุดสิ้นสุด ในแกน x และ y
# cv2.line(imgresize, (0,0), (100,100), (255,0,0), 5) #รูปภาพ,จุดเริ่มต้น,จุดสิ้นสุด,สี,ความหนา 

#ลองย้ายพิกัด
# cv2.line(imgresize, (100,100), (500,200), (255,0,0), 5) #รูปภาพ,จุดเริ่มต้น,จุดสิ้นสุด,สี,ความหนา 

#วาดเส้นตรงเพิ่มหัวลูกศรเข้ามา
cv2.arrowedLine(imgresize, (100,100), (500,200), (255,0,0), 10)#สีน้ำเงิน #รูปภาพ,จุดเริ่มต้น,จุดสิ้นสุด,สี,ความหนา
#เราสามารถวาดได้มากกว่า 1 เส้น
cv2.arrowedLine(imgresize, (20,0), (400,400), (0,255,0), 10)#สีเขียว #รูปภาพ,จุดเริ่มต้น,จุดสิ้นสุด,สี,ความหนา
cv2.arrowedLine(imgresize, (0,0), (600,400), (0,0,255), 10)#สีแดง #รูปภาพ,จุดเริ่มต้น,จุดสิ้นสุด,สี,ความหนา

#แสดงภาพ
cv2.imshow("Output", imgresize)
cv2.waitKey(0)
cv2.destroyAllWindows()
