#ตรวจจับค่าสีด้วย Mouse Event basic16
import cv2 #เรียกใช้ cv2

#อ่านรูปภาพ
img = cv2.imread("image/RGB_CMYK.png") 

#ปรับขนาดรูปภาพ
imgresize = cv2.resize(img,(850,500))#ความกว้าง,ความสูง

#ใช้ความรู้จากbasic15
#อันดับแรกเราต้องไปอ่านค่าสีจากรูปภาพก่อน สีน้ำเงิน ,สีเขียว ,สีแดง
def clickPosition(event, x, y, flags, param):
    if event == cv2.EVENT_LBUTTONDOWN:
        #เพิ่มส่วนนี้เข้าไปในอาเรย์ตัวที่3คือสิ่งที่จะบอกว่าคือค่าสีอะไร
        blue = imgresize[y,x,0]#เราจะเอาค่าสีที่อ่านได้มาเก็บไว้ในตัวแปร blue
        green = imgresize[y,x,1]#เราจะเอาค่าสีที่อ่านได้มาเก็บไว้ในตัวแปร green
        red = imgresize[y,x,2]#เราจะเอาค่าสีที่อ่านได้มาเก็บไว้ในตัวแปร red
        
        #เปลี่ยนเป็นเป็น stringแล้วในstr() ตรงใน()คือสีที่จะเอามาแสดง
        text = str(blue) + " , " + str(green) + " , " + str(red)
        cv2.putText(imgresize, text, (x,y), cv2.FONT_HERSHEY_SIMPLEX, 0.7  , (0,0,0), cv2.LINE_4)
        cv2.imshow("Output", imgresize)
        #output ที่ได้เวลาคลิกเมาส์ที่ภาพ จะแสดงค่าสีที่อ่านได้ออกมาเป็น (_ , _ , _ ) โดยอันแรกเป็นสีน้ำเงิน ,อันที่สองเป็นสีเขียว ,อันที่สามเป็นสีแดง
        #โดย ยกตัวอย่างว่า สีน้ำเงินเป็น (0 , 0 , 255) สีเขียวเป็น (0 , 255 , 0) และสีแดงเป็น (255 , 0 , 0) เลขอ่านจะไม่ใช่255เสมอไปมันคือความเข้มของสี 
        #แต่ให้ดูตำแหน่งที่ต้วเลขปรากฏในภาพ จะคือสีของมันว่าออกไปทางสีแดงนะเป็นต้น (เช่น 0,0,184)

#แสดงภาพ
cv2.imshow("Output", imgresize)

#ตรวจจับค่าสีด้วย Mouse 

#ทำงานกับ Mouse 
#setMouseCallback(ภาพ หรือ window name,ฟังก์ชันที่จะทำงาน)
cv2.setMouseCallback("Output", clickPosition) #cilckPosition คือฟังก์ชันที่เราจะใช้ทำงาน
cv2.waitKey(0)#รอให้ผู้ใช้งานกดปุ่มเพื่อปิดหน้าต่าง
cv2.destroyAllWindows()#ปิดหน้าต่าง
#note:
#สีเขียวเป็น (0 , 255 , 0) รวมกับสีแดงเป็น (255 , 0 , 0) จะเป็นสีเหลือง (0 , 255 , 255)
#สีเขียวเป็น (0 , 255 , 0) รวมกับสีน้ำเงินเป็น (0 , 0 , 255) จะเป็นสีฟ้า (255 , 255 , 0)