##วาดเส้นสี่เหลี่ยมใส่ภาพนิ่ง,วีดิโอ  basic10
import cv2 
img = cv2.imread("image/Klage.jpeg")#อ่านภาพเข้ามา

#กำหนดขนาดภาพ
imgresize = cv2.resize(img, (700,700))#ความกว้าง,ความสูง #imgresize คือ ตัวแปรที่สร้างไว้เก็บภาพ

#วาดเส้นสี่เหลี่ยม
#rectangle (ภาพ , มุมที่1(บนซ้าย) , มุมที่2(ล่างขวา) , สี (BGR), ความหนา) #สีเป็น BGR คือ blue , green , red

cv2.rectangle(imgresize, (0,0), (100,200), (0,255,0), 10) #รูปภาพ,จุดเริ่มต้น(x,y),จุดสิ้นสุด(x,y),สี,ความหนา 

#ลองย้ายพิกัด
cv2.rectangle(imgresize, (100,100), (500,500), (0,0,255), 10) #รูปภาพ,จุดเริ่มต้น(x,y),จุดสิ้นสุด(x,y),สี,ความหนา 

#เติมสีในเต็มกล่องสี่เหลี่ยมที่สร้างมา คือ ความหนาให้กำหนดเป็น -1 มันการขยายเส้นขอบให้เต็มพื้นที่

cv2.rectangle(imgresize, (600,600), (300,300), (255,0,0), -1) #รูปภาพ,จุดเริ่มต้น(x,y),จุดสิ้นสุด(x,y),สี,ความหนา 


#แสดงภาพ
cv2.imshow("Output", imgresize)#แสดงภาพ
cv2.waitKey(0)#รอปิดหน้าต่าง
cv2.destroyAllWindows()#ปิดหน้าต่าง