#เปิดกล้อง opencv
#การเปิดกล้องเหมือนเปิดภาพเรียงซ้อนกัน ทีละเฟรมทีละเฟรมซ้อนกัน ต่อวินาที และเป็นวีดีโอ
import cv2

cap = cv2.VideoCapture(2)#เปิดกล้อง เป็น 0 คือ มีกล้อง 1ตัว แต่ถ้ามีกล้องหลายตัว ให้เปลี่ยนเป็น  (0 กับ 1 เช่น (0,1)) ,cap คือตัวแปรที่เปิดกล้อง
#เช่น cap0 = cv2.VideoCapture(0)
#cap1 = cv2.VideoCapture(1)
#cap2 = cv2.VideoCapture(2)
#recap วนเช็คกล้อง 3 ตัว ได้ 0 คือกล้อง snapcam ไม่ควรใช้, 1 คือกล้อง  notebook  2 คือกล้อง webcam

while (True): #ใช้ while เพื่อให้หน้าต่างไม่ปิดอัตโนมัติ ดพราะไม่รู้จะเปลี่ยนกล้องตอนไหน
    ref, frame = cap.read() #รับภาพจากกล้อง frame ต่อ frame , 1 ภาพก็เป็น 1 frame
    
#เพิ่มเติม  ref  คือ ตัวแปรที่สร้างมาเก็บค่า มันคือ boolean ถ้าอ่านภาพได้จะเป็น True ถ้าไม่อ่านภาพได้จะเป็น False 
#ถ้าไม่ใช้ ref จะใช้check แทน ก็ได้ตั้งชื่อตัวแปรยังไงก็ได้ให้เราเข้าใจว่ามันคืออะไร
#frame คือ ตัวแปรที่สร้างมาเก็บภาพที่อ่านได้ มันคือภาพที่ได้จากการ capture จากกล้อง
#โดยค่า frame จะได้ก็มาจากถ้า ตัวแปร ref เป็นจริงก็จะได้เป็นภาพมา จากกล้อง ถ้า เป็นเท็จก็จะไม่ได้รับภาพมาจากกล้อง เป็น ค่า none

    cv2.imshow("Output", frame)#แสดงภาพ
    if cv2.waitKey(1) & 0xFF == ord("q"):
        break #ถ้ากด q ให้หน้าต่างปิดอัตโนมัติ เพราะเราทำเป็น while มันเลยอ่านภาพตลอดเลยต้องมีคำสั่งมา break
    
cap.release() #ปิดกล้อง
cv2.destroyAllWindows() #ปิดหน้าต่าง ,คืนค่าเครื่อง