#วาดวงกลมในภาพ basic12
import cv2 #เรียกใช้ cv2

#อ่านภาพ
img = cv2.imread("image/Klage.jpeg")

#กำหนดขนาด
imgresize = cv2.resize(img, (700,700))

#วาดวงกลม
#circle(ภาพที่จะวาดวงกลม,ตำแหน่งจุดศูนย์กลางวงกลม(x,y),รัศมี,สี,ความหนา)

#วาดวงกลมสีแดง
cv2.circle(imgresize,(200,200),30,(0,0,255),5) 

#วาดวงกลมสีขาว แบบเต็มพื้นที่วงกลม ด้วย -1
#วงกลมจะใหญ่ขึ้น ตามรัศมีที่เรากําหนด
cv2.circle(imgresize,(400,400),70,(255,255,255),-1) #สีขาว คือ (255,255,255)

#วาดวงกลมสีเขียว แบบเต็มพื้นที่วงกลม ด้วย -1
cv2.circle(imgresize,(600,600),50,(0,255,0),-1)

#แสดงภาพ
cv2.imshow("Output", imgresize)
cv2.waitKey(0)#รอปิดหน้าต่าง
cv2.destroyAllWindows()#ปิดหน้าต่าง